ЛИС2/src/Catalogs/ПроизводственныеПлощадки/ПроизводственныеПлощадки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПроизводственныеПлощадки</name>
  <comment>Справочник содержит список производственных площадок предприятия.</comment>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>КодОКТМО</name>
    <type>
      <types>CatalogRef.ОКТМО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакНегативногоВоздействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакОсобоОхраняемойТерритории</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакЛечебноОздоровительнойМестности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакРайонаКрайнегоСевера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакТерриторииБайкала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакЗоныЭкологическогоБедствия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВЧертеНаселенныхМест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ПризнакОбъектаВодоснабжения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияРыбохозяйственногоЗначения</name>
    <type>
      <types>EnumRef.КатегорияРыбохозяйственногоЗначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФоноваяКонцентрацияВзвешенныхВеществ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВПределахПромышленнойЗоны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакСпециализированногоПолигона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_КодОчистныхСооружений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_МощностьОчистныхСооружений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ВодохозяйственныйУчасток</name>
    <type>
      <types>CatalogRef.ВодохозяйственныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <type>
      <types>CatalogRef.ОКАТО</types>
    </type>
  </attributes>
  <attributes>
    <name>НаходитсяРядомСВО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГеометрическаяХарактеристикаИсточниковЗагрязнения</name>
    <type>
      <types>EnumRef.ГеометрическиеХарактеристикиИсточниковЗагрязнения</types>
    </type>
  </attributes>
  <attributes>
    <name>НормативнаяСЗЗ</name>
    <type>
      <types>EnumRef.РазмерыНормативныхСЗЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ПроектнаяСЗЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БассейновыйОкруг</name>
    <type>
      <types>CatalogRef.ВодохозяйственныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭксплуатации</name>
    <type>
      <types>EnumRef.СостояниеЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>КритерийТрансформацииАзота</name>
    <type>
      <types>CatalogRef.КритерииРегиональныхКоэффициентовТрансформацииАзота</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаОтсчета</name>
    <type>
      <types>CatalogRef.ТочкиОтсчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицензионныйУчасток</name>
    <type>
      <types>CatalogRef.ЛицензионныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>КодМоря</name>
    <type>
      <types>EnumRef.МореРФ</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньГосударственногоЭкологическогоНадзора</name>
    <type>
      <types>EnumRef.УровеньГосударственногоЭкологическогоНадзора</types>
    </type>
  </attributes>
  <attributes>
    <name>МореИлиШельф</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакСудна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВодныйОбъектПитьевогоИХозяйственноБытовогоВодоснабжения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТерриторииОбъекта</name>
    <type>
      <types>EnumRef.ТипыТерриторийОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>СанитарноЗащитнаяЗона</name>
    <type>
      <types>CatalogRef.СанитарноЗащитныеЗоны</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПунктыНаблюденияТочкиЗамера</name>
    <attributes>
      <name>НомерСтвора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоордСевШир</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоордВостДолг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресПунктаЗамера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыВременногоНакопленияОтходов</name>
    <attributes>
      <name>ОбъектВременногоНакопленияОтходов</name>
      <type>
        <types>EnumRef.ОбъектыВременногоХраненияОтходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/Catalogs/ПроизводственныеПлощадки/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	Если ЗначениеЗаполнено(Параметры.Отбор) Тогда			
		Элементы.ОрганизацииСписок.Видимость = Ложь;				
	КонецЕсли;	
	
	// (++) Зиновьев А.В., 23.10.2017, отбор по организации и вышестоящей.
	Если Параметры.Свойство("ОрганизацияДляОтбора") Тогда
		Элементы.ОрганизацииСписок.Видимость = Ложь;
		УстановитьОтборПоОрганизациям();
	КонецЕсли; 
	// (--) Зиновьев А.В., 23.10.2017 
	
	// {EXTCODE 12.01.2017 12:13:16 Кузнецов Д.В. , МВЗ
	Если Параметры.Свойство("ОтборОбъектПлатыНВОС") Тогда 
		Элементы.ОрганизацииСписок.Видимость = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", 
		Параметры.Организация, ВидСравненияКомпоновкиДанных.Равно,,Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	// }EXTCODE 12.01.2017 12:13:19 Кузнецов Д.В. , МВЗ
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацииСписокПриАктивизацииСтроки(Элемент)
	
	ОрганизацияОтбора = ОпределитьТекущуюОрганизациюСписка();
	
	Если ОрганизацияОтбора = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", ОрганизацияОтбора, , , Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", ОрганизацияОтбора, , , Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ОрганизацияОтбора = ОпределитьТекущуюОрганизациюСписка();
	
	Если ЗначениеЗаполнено(ОрганизацияОтбора) Тогда
		
		Отказ = Истина;
		
		СтруктураПараметров = Новый Структура("ЗначенияЗаполнения", Новый Структура("Организация, Владелец", ОрганизацияОтбора, ОрганизацияОтбора));
		
		ОткрытьФорму("Справочник.ПроизводственныеПлощадки.ФормаОбъекта", СтруктураПараметров, ЭтаФорма);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ОпределитьТекущуюОрганизациюСписка()
	
	ОрганизацияОтбора = Неопределено;
	
	ТекущиеДанные = Элементы.ОрганизацииСписок.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда 
		ОрганизацияОтбора = ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	Возврат ОрганизацияОтбора;
	
КонецФункции

&НаСервере
Процедура УстановитьОтборПоОрганизациям()
	
	Параметры.Отбор.Очистить();
	
	Список.Отбор.Элементы.Очистить();
	
	Группа = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	Группа.Использование = Истина;
	Группа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли; 
	
	лкВышестоящаяОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ОрганизацияДляОтбора, "Родитель");
	
	Если лкВышестоящаяОрганизация <> ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка") Тогда
		
		ЭлОтбора = Группа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Организация");
		ЭлОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлОтбора.Использование	= Истина;
		ЭлОтбора.ПравоеЗначение = лкВышестоящаяОрганизация;
		
	КонецЕсли; 
	
	ЭлОтбора = Группа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Организация");
	ЭлОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.Использование	= Истина;
	ЭлОтбора.ПравоеЗначение = Параметры.ОрганизацияДляОтбора;
	
КонецПроцедуры

#КонецОбласти
